Map<String, String> kmKH = {
  "setting": "ការកំណត់",
  "theme": "ផ្ទាំង",
  "security": "សុវត្ថិភាព​ និង​ កាេចូលប្រើប្រាស់",
  "feedback": "មតិស្ថាបនា",
  "condition": "លក្ខខណ្ឌ និង​ គោលការណ៍",
  "app": "អំពីកម្មវិធី",
  "developer": "អំពីអ្នកបង្កើតកម្មវិធី",
  "logout": "ចាកចេញ",
  "cpwd": "ផ្លាស់ប្តូរពាក្យសម្ងាត់",
  "translate": "ភាសាខ្មែរ",
  "create acc": "បង្កើតគណនី",
  "signup": "ចុះឈ្មោះដើម្បីប្រើប្រាស់មុខងារទាំងអស់",
  "guest user": "បង្កើតគណនី",
  "acc": "គណនី",

  // ===== Notification =====
  "notification": "ការជូនដំណឹង",
  "system_notification": "ការជូនដំណឹងប្រព័ន្ធ",
  "system": "ប្រព័ន្ធ",
  "interaction": "អន្តរកម្ម",
  "message": "សារ",
  "like": "ចូលចិត្ត",
  "push_notification": "ការជូនដំណឹងរុញ",
  "app_update_notification":
      "ការធ្វើបច្ចុប្បន្នភាពកម្មវិធី\nមុខងារថ្មី និងការធ្វើបច្ចុប្បន្នភាព",

  //  ===== Edit Profile =====
  "editprofile": "កែសម្រួលប្រវត្តិរូប",
  "fristName": "នាមត្រកូល",
  "lastName": "នាមខ្លួន",
  "email": "អ៊ីម៉ែល",
  "gender": "ភេទ",
  "female": "ស្រី",
  "male": "ប្រុស",

  //  ===== Change Passsword =====
  "changePWD": "ផ្លាស់ប្តូរពាក្យសម្ងាត់",
  "currentPWD": "ពាក្យសម្ងាត់បច្ចុប្បន្ន",
  "enterCurrentPWD": "បញ្ចូលពាក្យសម្ងាត់បច្ចុប្បន្ន",
  "newPWD": "ពាក្យសម្ងាត់ថ្មី",
  "enterNewPWD": "បញ្ចូលពាក្យសម្ងាត់ថ្មី",
  "pwd8char": "ពាក្យសម្ងាត់ត្រូវតែមានយ៉ាងហោចណាស់ 8 តួអក្សរ",
  "cfNewPWD": "បញ្ជាក់ពាក្យសម្ងាត់ថ្មី",
  "cfNewPWD1": "បញ្ជាក់ពាក្យសម្ងាត់ថ្មី",
  "PWDrequirements": "តម្រូវការពាក្យសម្ងាត់",
  "least8char": "យ៉ាងហោចណាស់ 8 តួអក្សរ",
  "oneLetter": "មានអក្សរយ៉ាងហោចណាស់មួយ",
  "oneNum": "មានលេខយ៉ាងហោចណាស់មួយ",

  //  ===== Language =====
  "language": "ភាសា",
  "khmer": "ខ្មែរ",
  "english": "អង់គ្លេស",

  //  ===== Theme mode =====
  "theme_mode": "រូបរាង",
  "light": "ភ្លឺ",
  "dark": "ងងឹង",

  //  ===== Privacy & Security =====
  "security_": "សុវត្ថិភាព និង​ ការចូលប្រើប្រាស់",
  "acc_secure": "គណនីរបស់អ្នកមានសុវត្ថិភាព",
  "acc_secure1": "ការកំណត់សុវត្ថិភាពទាំងអស់ត្រូវបានបើកដំណើរការ",
  "log&sec": "ចូល និង សុវត្ថិភាព",
  "tow_step_verif": "ការផ្ទៀងផ្ទាត់ពីរជំហាន",
  "tow_step_verif_desc": "បន្ថែមស្រទាប់សុវត្ថិភាពបន្ថែម",
  "finger": "ចូលដោយស្នាមម្រាមដៃ",
  "finger_desc": "ប្រើស្នាមម្រាមដៃដើម្បីចូល",
  "device": "សម័យចូលសកម្ម",
  "iphone": "iPhone 14 Pro",
  "iphone_desc": "ភ្នំពេញ, កម្ពុជា\nចូលចុងក្រោយ: ឥឡូវនេះ",
  "samsung": "Samsung Galaxy S23",
  "samsung_desc": "សៀមរាប , កម្ពុជា\nចូលចុងក្រោយ: ម្សិលមិញ",
  "safety": "សុវត្ថិភាព",
  "safety_1": "ផ្លាស់ប្តូរពាក្យសម្ងាត់ជាទៀងទាត់",
  "safety_1_desc": "យើងសូមណែនាំឱ្យផ្លាស់ប្តូរពាក្យសម្ងាត់របស់អ្នករៀងរាល់ 3 ខែ",
  "safety_2": "កុំចែករំលែកពាក្យសម្ងាត់",
  "safety_2_desc": "កុំឱ្យពាក្យសម្ងាត់របស់អ្នកទៅនរណាម្នាក់",

  //  ===== Feedback =====
  "do_you_like_app": "តើអ្នកពេញចិត្តកម្មវិធីរបស់យើងដែរទេ?",
  "do_you_like_app_desc": "មតិរបស់អ្នកជួយយើងកែលម្អកម្មវិធី",
  "point": "ពិន្ទុ",
  "review_type": "ប្រភេទមតិយោបល់",
  "type1": "មុខងារ",
  "type2": "ការរចនា",
  "type3": "ល្បឿន",
  "type4": "ការប្រើប្រាស់",
  "type5": "ផ្សេងៗ",
  "submit_review": "ផ្ញើមតិយោបល់",

  // ===== Terms & Conditions =====
  "terms_conditions": "លក្ខខណ្ឌ និង គោលការណ៍",
  "terms_of_use": "លក្ខខណ្ឌនៃការប្រើប្រាស់",
  "last_updated": "ធ្វើបច្ចុប្បន្នភាព: ១៥ មករា ២០២៦",

  "tc_acceptance_title": "១. ការទទួលយកលក្ខខណ្ឌ",
  "tc_acceptance_desc":
      "ដោយការចូលប្រើ ឬប្រើប្រាស់កម្មវិធីនេះ អ្នកយល់ព្រមទទួលយកលក្ខខណ្ឌទាំងនេះ។ ប្រសិនបើអ្នកមិនយល់ព្រម សូមកុំប្រើកម្មវិធីនេះ។",

  "tc_use_title": "២. ការប្រើប្រាស់កម្មវិធី",
  "tc_use_desc": "អ្នកយល់ព្រមថា៖",
  "tc_use_rule":
      "- ប្រើកម្មវិធីសម្រាប់គោលបំណងស្របច្បាប់ប៉ុណ្ណោះ\n- មិនរំលោភបំពានសិទ្ធិអ្នកប្រើផ្សេងទៀត\n- ឬចែករំលែកមាតិកាមិនសមរម្យ\nរ- ក្សាសុវត្ថិភាពព័ត៌មានគណនីរបស់អ្នក",

  "tc_privacy_title": "៣. ភាពឯកជន",
  "tc_privacy_desc":
      "យើងយកចិត្តទុកដាក់ខ្លាំងចំពោះភាពឯកជនរបស់អ្នក។ ព័ត៌មានផ្ទាល់ខ្លួនរបស់អ្នកនឹងត្រូវបានរក្សាទុកដោយសុវត្ថិភាព និងមិនត្រូវបានចែករំលែកជាមួយភាគីទីបីដោយគ្មានការយល់ព្រមរបស់អ្នក។",

  "tc_ip_title": "៤. កម្មសិទ្ធិបញ្ញា",
  "tc_ip_desc":
      "មាតិកាទាំងអស់នៅក្នុងកម្មវិធីនេះ រួមមានអត្ថបទ រូបភាព និងកូដកម្មវិធី គឺជាកម្មសិទ្ធិបញ្ញារបស់យើង។",

  "tc_liability_title": "៥. ការកំណត់ទំនួលខុសត្រូវ",
  "tc_liability_desc":
      "កម្មវិធីនេះត្រូវបានផ្តល់ជូន \"តាមដែលមាន\"។ យើងមិនធានាអំពីភាពពេញលេញ ភាពត្រឹមត្រូវ ឬភាពទុកចិត្តបានរបស់កម្មវិធីនោះទេ។",

  "tc_changes_title": "៦. ការផ្លាស់ប្តូរលក្ខខណ្ឌ",
  "tc_changes_desc":
      "យើងរក្សាសិទ្ធិក្នុងការកែប្រែលក្ខខណ្ឌទាំងនេះគ្រប់ពេល។ ការប្រើប្រាស់បន្តរបស់អ្នកបន្ទាប់ពីការផ្លាស់ប្តូរនឹងមានន័យថាអ្នកយល់ព្រមជាមួយការផ្លាស់ប្តូរទាំងនោះ។",

  "tc_contact_title": "៧. ទំនាក់ទំនង",
  "tc_contact_desc":
      "ប្រសិនបើអ្នកមានសំណួរអំពីលក្ខខណ្ឌទាំងនេះ សូមទាក់ទងមកយើងតាម៖\nsupport@camexplore.com",

  "related_docs": "ឯកសារពាក់ព័ន្ធ",
  "privacy_policy":
      "គោលការណ៍ភាពឯកជន\nអានពីរបៀបដែលយើងប្រើប្រាស់ទិន្នន័យរបស់អ្នក",
  "privacy_policy": "គោលការណ៍ភាពឯកជន",
  "privacy_policy_desc": "អានពីរបៀបដែលយើងប្រើប្រាស់ទិន្នន័យរបស់អ្នក",

  //  ===== About CamExplore =====
  "about_cam": "អំពីកម្មវិធី CamExplore",
  "about": "អំពីកម្មវិធី",
  "about_cam_desc":
      "CamExploreគឺជាកម្មវិធីដែលជួយអ្នកក្នុងការស្វែងរកកន្លែងទេសចរណ៍ វប្បធម៌ ម្ហូបអាហារនិងព្រឹត្តិការណ៍នានានៅក្នុងប្រទេសកម្ពុជា ។យើងផ្តល់ព័ត៌មានលម្អិតអំពីទីតាំងទេសចរណ៍ប្រវត្តិសាស្រ្ត និងវប្បធម៌កម្ពុជា។",
  "Important": "មុខងារសំខាន់",
  "cam_goal": "គោលបំណង",
  "goal_desc":
      "គោលបំណងរបស់ CamExplore គឺបង្កើតឡើងដើម្បីលើកកម្ពស់ទេសចរណ៍កម្ពុជា និងជួយដល់ភ្ញៀវទេសចរណ៍ជាតិនិងអន្តរជាតិងាយស្រួលក្នុងការសិក្សាស្វែងយល់ពី ប្រវត្តិសាស្ត្រ  ​វប្បធម និង ស្វែងរកកន្លែងទេសចរណ៍ ម្ហូបអាហារនៅក្នុងប្រទេសកម្ពុជា។",

  //  ===== Organization =====
  "organ_title": "អំពីអ្នកបង្កើតកម្មវិធី",
  "about_app_title": "ក្រុមអ្នកបង្កើត CamExplore",
  "about_app_desc":
      "CamExplore\n គឺជាកម្មវិធីទេសចរណ៍ដែលត្រូវបានបង្កើតឡើងដោយក្រុមនិស្សិត ដើម្បីជួយអ្នកប្រើប្រាស់ស្វែងរកកន្លែងទេសចរណ៍ វប្បធម៌ ម្ហូបអាហារ និងព្រឹត្តិការណ៍សំខាន់ៗនៅក្នុងប្រទេសកម្ពុជា។ កម្មវិធីនេះមានគោលបំណងបង្ហាញអំពីសម្រស់ និងអត្តសញ្ញាណវប្បធម៌នៃប្រទេសកម្ពុជា។",
  "mission_title": "បេសកកម្មរបស់យើង",
  "mission_desc":
      "យើងខិតខំបង្កើតកម្មវិធីដែលងាយស្រួលប្រើប្រាស់ មានប្រសិទ្ធភាព និងសមស្របសម្រាប់អ្នកប្រើប្រាស់នៅកម្ពុជា ដោយផ្តោតលើគុណភាព និងបទពិសោធន៍អ្នកប្រើប្រាស់ជាចម្បង។",
  "developer_title": "ក្រុមអ្នកអភិវឌ្ឍន៍កម្មវិធី",
  "dev_1": "គាត​ សុម៉ារីណា",
  "dev_2": "តាំង ណៃហ៊ួយ",
  "dev_3": "តាំងអូន​​ សុខហេង",
  "dev_4": "អាំង វួចលី",

  //  ===== Others =====
  "Gallery": "រូបភាព",
  "Camera": "កាមេរ៉ា",

  //
  "name": "ឈ្មោះ",
  "contact_us": "ទំនាក់ទំនង",
  "leave": "ចាកចេញ",
  "now": "បច្ចុប្បន្ន",
  "open": "បើក",
  "phone": "លេខទូរស័ព្ទ",
  "cancel": "បោះបង់",
  "save": "រក្សាទុក",

  //////////////////////////////////////////////////////////////////////////////////////////////////////
  ///////     Login Screen
  "Login": "ចូលគណនី",
  "Phone Number": "លេខទូរស័ព្ទ",
  "Email": "អ៊ីម៉ែល",
  "Password": "ពាក្យសម្ងាត់",
  "Or": "ឬ",

  //////////////////////////////////////////////////////////////////////////////////////////////////////
};
